<details><summary>Show Plan</summary>

```

terraform
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=44]
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e8c738d4-a43b-41aa-83ac-ac6d8a3e5f65]
module.ecs.data.aws_vpc.vpc: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.redis.data.aws_vpc.vpc: Reading...
data.aws_ecr_repository.repository: Reading...
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/f3565b91-c093-4dfd-9916-76f16cc6cbe8]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z09669243E0Q6ZCWCIW2U]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=45]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220908201556715000000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526273800000003]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526269000000002]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
data.aws_ecr_repository.repository: Read complete after 1s [id=rpc-proxy]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_rpc-proxy]
module.ecs.data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.redis.data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.ecs.aws_security_group.tls_ingess: Refreshing state... [id=sg-0f3c213ea19bfc4d7]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-0fdb388e2b1c042d3]
module.ecs.data.aws_subnets.public_subnets: Reading...
module.redis.data.aws_subnets.private_subnets: Reading...
module.ecs.data.aws_subnets.private_subnets: Reading...
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-ded/8d9823f8adeda723]
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-0dc8dc9dd50d9922f]
module.redis.data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=rpc-proxy-rpc-staging-private-subnet-group]
module.ecs.data.aws_subnets.public_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6]
module.ecs.data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=rpc-proxy-rpc-staging]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs.aws_ecs_task_definition.app_task has been deleted
  - resource "aws_ecs_task_definition" "app_task" {
      - arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:28" -> null
      - family                   = "staging_rpc-proxy" -> null
        id                       = "staging_rpc-proxy"
        tags                     = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:29" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task will be created
  + resource "aws_ecs_task_definition" "app_task" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::898587786287:role/staging_rpc-proxy_ecs_task_execution_role"
      + family                   = "staging_rpc-proxy"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Application"      = "rpc-proxy"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "rpc-proxy"
          + "ProvisionedBy"    = "Terraform"
        }
      + task_role_arn            = "arn:aws:iam::898587786287:role/staging_rpc-proxy_ecs_task_execution_role"

      + runtime_platform {
          + operating_system_family = "LINUX"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.o11y.grafana_data_source.prometheus,
  on monitoring/main.tf line 12, in resource "grafana_data_source" "prometheus":
  12: resource "grafana_data_source" "prometheus" {

Use json_data_encoded instead. It supports arbitrary JSON data, and therefore
all attributes.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*